Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic class wraps a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t as a Tekla.BIM.DirectManipulation.Services.Graphics.Graphic.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic.#ctor(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic class.
handle: The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t to wrap.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic.NativeHandle
Gets the wrapped Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t instance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic.Id
Gets the identifier.